In [62]:
import pandas as pd

In [63]:
spott_df = pd.read_csv('spott_df.csv')

In [64]:
spott_df = spott_df.drop(columns='Unnamed: 0')

In [65]:
spott_df.head()

      Cities  Population  Elevation
0      Tokyo   8336599.0       44.0
1    Jakarta   8540121.0       16.0
2  New York    8175133.0       10.0
3      Seoul  10349312.0       38.0
4     Manila   1600000.0       13.0

In [66]:
waqi_df = pd.read_csv('waqi_df.csv')

In [67]:
waqi_df = waqi_df.drop(columns=['Unnamed: 0', 'aqi', 'date'])

In [68]:
waqi_df = waqi_df.rename(columns={'cities': 'Cities', 'latitude': 'Latitude', 'longitude': 'Longitude', 'pm25': 'PM25', 'pm10': 'PM10', 'o3':'O3', 'uvi': 'UVI'})

In [69]:
waqi_df.head()

      Cities   Latitude   Longitude  PM25   PM10   O3  UVI
0      Tokyo  35.641463  139.698171   1.0   21.0  1.0  0.0
1    Jakarta  -6.182536  106.834236  42.0  173.0  7.0  3.0
2  New York   40.712784  -74.005941  97.0   27.0  8.0  1.0
3      Seoul  37.566535  126.977969  74.0   24.0  3.0  0.0
4     Manila  14.599512  120.984220   NaN    NaN  NaN  NaN

In [70]:
combined_df = spott_df.merge(waqi_df, how='inner', on='Cities')

In [71]:
combined_df = combined_df.dropna()

In [72]:
combined_df = combined_df.reset_index().drop(columns='index')

In [74]:
combined_df

,Cities,Population,Elevation,Latitude,Longitude,PM25,PM10,O3,UVI
0,Tokyo,8336599.0,44.0,35.641463,139.698171,1.0,21.0,1.0,0.0
1,Jakarta,8540121.0,16.0,-6.182536,106.834236,42.0,173.0,7.0,3.0
2,New York,8175133.0,10.0,40.712784,-74.005941,97.0,27.0,8.0,1.0
3,Seoul,10349312.0,38.0,37.566535,126.977969,74.0,24.0,3.0,0.0
4,Mumbai,12691836.0,8.0,19.072830,72.882610,167.0,58.0,18.0,2.0
...,...,...,...,...,...,...,...,...,...
483,Vientiane,196731.0,174.0,17.896122,102.640000,68.0,37.0,17.0,0.0
484,Yicheng,176006.0,10.0,31.354200,119.817700,112.0,27.0,3.0,0.0
485,Skoplje,474889.0,247.0,41.992500,21.423611,145.0,48.0,15.0,1.0
486,Dali,14760.0,1517.0,25.581100,100.217100,42.0,19.0,4.0,0.0
487,Rasht,594590.0,4.0,37.316581,49.606528,33.0,35.0,4.0,1.0